Autodesk.Revit.DB.Structure.ReinforcementUtils.IntersectSurfaceWithCurve(Autodesk.Revit.DB.Surface,Autodesk.Revit.DB.Curve)
Intersects a surface with a curve and returns the intersection points.
If the curve is bound, the intersection points will be between the curve's end points.
surface:
The surface to intersect with.
curve:
The curve to intersect with.
Returns:
Intersection points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.ComputeInteriorDirectionForLappedCircleOrSpiral(Autodesk.Revit.DB.Structure.Rebar,System.Int32)
Returns the internal direction for lapped circle or spiral bar.
For shape driven this is particularly important because the arrow in edit constraints will have this direction.
rebar:
The rebar for which the direction is requested.
barIndex:
The bar index for which the direction is requested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetClosestBarIndexInView(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.View)
Returns the index of the closest bar visible in the view.
rebar:
The rebar for which the closest bar index is requested.
pView:
The view in which the closest bar index is requested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetViewCutPlane(Autodesk.Revit.DB.View)
Returns the cut plane for the view.
view:
The view for which the cut plane is requested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.IsDefaultFFRForPlacingAlong3dPath(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if the barId is the default one or one that corresponds to the created rebar whose curves will be used.
document:
The document.
barId:
The bar id to test
Returns:
Returns true if the barId is the default one.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetAllDependentElements(Autodesk.Revit.DB.Element)
Get all elements that are children of this Element.
Returns:
Both parital and total children of this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.InitializeRebarInterface(Autodesk.Revit.DB.Structure.IRebarInterface)
Utilize this function to initialize IRebarInterface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetCrankStraightLengthAtEnd(Autodesk.Revit.DB.Element,System.Int32)
Gets the crank segment length at the specified index, at the specified end.
reinforcementElement:
The reinforcement element.
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the the crank straight length at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetCrankLengthAtEnd(Autodesk.Revit.DB.Element,System.Int32)
Gets the crank segment length at the specified index, at the specified end.
reinforcementElement:
The reinforcement element.
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the the crank segment length at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.ScaleCrankDimensions(Autodesk.Revit.DB.Structure.RebarBendData,System.Double,System.Double)
Scale the crank parameters and returns a sclaed RebarBendData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.AddCrankToCurves(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarBendData)
Adds crank to the start and end of the provided chain of curves.
Remarks:
Returns the curves, the crank segments and the crank fillets at both ends. The initial start and end curves are trimmed for the crank fillet to fit.
If the crank can't be added it will throw InvalidOperationException.
curveChain:
A chain of curves to which cranks will be added.
rebarBendData:
The RebarBendData class from which the cranks will take its properties.
Returns:
The curves and the cranks at both ends. The initial start and end curves are trimmed for the hook fillet to fit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetCrankAtIndexAtEnd(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the Crank Type id of the bar at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the Crank type id of the bar at the specified index, at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetTerminationRotationAngleAtIndexAtEnd(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the termination's out of plane (e.g. hook, crank) rotation angle of the bar at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the termination's out of plane rotation angle of the bar at the specified index, at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBarPlaneAtIndex(Autodesk.Revit.DB.Element,System.Int32,System.Boolean,Autodesk.Revit.DB.Plane)
Gets the plane in which the reinforcement element is bent.
reinforcementElement:
The reinforcement element from which the normal data is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1)
applyIndividualBarTrf:
If true, the MovedBarTransform will be applied to the returned plane.
plane:
The plane in which the reinforcement element is bent. If this is returning false, the plane will be XoY
Returns:
Returns if a plane can be obtained, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBarBendingPlaneNormalAtIndex(Autodesk.Revit.DB.Element,System.Int32,Autodesk.Revit.DB.XYZ@)
Gets the normal of the plane in which the reinforcement element is bent.
reinforcementElement:
The reinforcement element from which the normal data is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1)
normal:
the normal of the plane in which the reinforcement element is bent. In case of a Free Form bar that is not planar, it will return XYZ(0,0,0)
Returns:
Returns true if it was able to calculate the normal for the input reinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBendDataAtIndex(Autodesk.Revit.DB.Element,System.Int32)
Gets the RebarBendData, at the specified bar index.
Remarks:
This method does not take into account the rotation of the bar relative to its default position along the distribution path when returning the termination plane normal.
reinforcementElement:
The reinforcement element from which the RebarBendData is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1), representing the bar in set from which we're retrieving the RebarBendData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].